Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: If the OPTIONS request includes an entity-body (as indicated by the presence of Content-Length or Transfer-Encoding), then the media type MUST be indicated by a Content-Type field.
zh_cn: 如果 OPTIONS 请求包括实体主体(由 Content-Length 或 Transfer-Encoding 的存在指示)，则媒体类型必须由 Content-Type 字段指示。

source: If the PKCS#1 padding is not correct, or the length of message M is not exactly 48 bytes:
zh_cn: 如果 PKCS#1 填充不正确，或者消息 M 的长度不正是 48 字节：

source: If the RawPublicKey certificate type was negotiated, then the certificate_list MUST contain no more than one CertificateEntry, which contains an ASN1_subjectPublicKeyInfo value as defined in [RFC7250], Section 3.
zh_cn: 如果协商了 RawPublicKey 证书类型，则 certificate_list 必须包含不超过一个 CertificateEntry，其中包含 [RFC7250] 第 3 节中定义的 ASN1_subjectPublicKeyInfo 值。

source: If the Request-URI does not point to an existing resource, and that URI is capable of being defined as a new resource by the requesting user agent, the origin server can create the resource with that URI.
zh_cn: 如果 Request-URI 未指向现有资源，并且该 URI 能够被请求用户代理定义为新资源，则源服务器可以使用该 URI 创建资源。

source: If the Request-URI is an asterisk ("*"), the OPTIONS request is intended to apply to the server in general rather than to a specific resource.
zh_cn: 如果 Request-URI 是星号(“*”)，则 OPTIONS 请求通常应用于服务器而不是特定资源。

source: If the Request-URI is encoded using the "% HEX HEX" encoding [42], the origin server MUST decode the Request-URI in order to properly interpret the request.
zh_cn: 如果使用 "% HEX HEX" 编码 [42] 对 Request-URI 进行编码，则源服务器必须解码 Request-URI 以正确解释请求。

source: If the Request-URI is not an absoluteURI, and the request includes a Host header field, the host is determined by the Host header field value.
zh_cn: 如果 Request-URI 不是 absoluteURI，并且请求包括 Host 首部字段，则主机由 Host 首部字段值确定。

source: If the Request-URI is not an asterisk, the OPTIONS request applies only to the options that are available when communicating with that resource.
zh_cn: 如果 Request-URI 不是星号，则 OPTIONS 请求仅适用于与该资源通信时可用的选项。

source: If the Request-URI refers to a data-producing process, it is the produced data which shall be returned as the entity in the response and not the source text of the process, unless that text happens to be the output of the process.
zh_cn: 如果 Request-URI 引用数据生成过程，则生成的数据应作为响应中的实体而不是过程的源文本返回，除非该文本恰好是过程的输出。

source: If the Request-URI refers to an already existing resource, the enclosed entity SHOULD be considered as a modified version of the one residing on the origin server.
zh_cn: 如果 Request-URI 引用已经存在的资源，则包含的实体应该被视为驻留在源服务器上的实体的修改版本。

source: If the SYN at line 6 had arrived before the RST, a more complex exchange might have occurred with RST's sent in both directions.
zh_cn: 如果第 6 行的 SYN 在 RST 之前到达，则可能在两个方向上发送 RST 时发生更复杂的交换。

source: If the TCP is in one of the synchronized states (ESTABLISHED, FIN-WAIT-1, FIN-WAIT-2, CLOSE-WAIT, CLOSING, LAST-ACK, TIME-WAIT), it aborts the connection and informs its user.
zh_cn: 如果 TCP 处于同步状态之一(ESTABLISHED，FIN-WAIT-1，FIN-WAIT-2，CLOSE-WAIT，CLOSING，LAST-ACK，TIME-WAIT)，它将中止连接并通知其用户。

source: If the URI scheme defines a default for host, then that default applies when the host subcomponent is undefined or when the registered name is empty (zero length).
zh_cn: 如果 URI 方案定义了 host 的默认值，那么当主机子组件未定义或注册名称为空(零长度)时，该默认值适用。

source: If the URI-reference's prefix does not match the syntax of a scheme followed by its colon separator, then the URI-reference is a relative reference.
zh_cn: 如果 URI 引用的前缀，与方案后跟冒号分隔符的语法不匹配，则 URI 引用是相对引用。

source: If the `initialRequest` is given, the `TestSubscriber` offers the `requestMore(long)` method to keep requesting in a fluent manner:
zh_cn: 如果给出 `initialRequest`，那么 `TestSubscriber` 提供 `requestMore(long)` 方法来以流畅的方式继续请求：

source: If the abs_path is not present in the URL, it MUST be given as "/" when used as a Request-URI for a resource (section 5.1.2).
zh_cn: 如果 URL 中不存在 abs_path，则在用作资源的 Request-URI 时必须以“/”形式给出(第 5.1.2 节)。

source: If the application protocol using TLS provides that any data may be carried over the underlying transport after the TLS connection is closed, the TLS implementation must receive the responding close_notify alert before indicating to the application layer that the TLS connection has ended.
zh_cn: 如果使用 TLS 的应用程序协议规定在 TLS 连接关闭后可以通过底层传输承载任何数据，则 TLS 实现必须在向应用层指示 TLS 连接已结束之前接收响应的 close_notify 警报。

source: If the application protocol will not transfer any additional data, but will only close the underlying transport connection, then the implementation MAY choose to close the transport without waiting for the responding close_notify.
zh_cn: 如果应用程序协议不会传输任何其他数据，只会关闭底层传输连接，那么实现可以选择关闭传输而无需等待响应的 close_notify。

source: If the authority component is missing or undefined for the target URI, then a client MUST send a Host header field with an empty field-value.
zh_cn: 如果目标 URI 缺少或未定义权限组件，则客户端必须发送具有空字段值的 Host 首部字段。

source: If the body is being sent using a "chunked" encoding (section 3.6), a zero length chunk and empty trailer MAY be used to prematurely mark the end of the message.
zh_cn: 如果正在使用“分块”编码发送正文(第 3.6 节)，则可以使用零长度块和空 trailer 来过早标记消息的结尾。

source: If the body was preceded by a Content-Length header, the client MUST close the connection.
zh_cn: 如果正文前面有 Content-Length 首部，则客户端必须关闭连接。

source: If the call is rewritten, it becomes obvious why it works so:
zh_cn: 如果调用被重写，为什么它会这样的原因就很明显：

source: If the certificate_authorities list is empty, then the client MAY send any certificate of the appropriate ClientCertificateType, unless there is some external arrangement to the contrary.
zh_cn: 如果 certificate_authorities 列表为空，则客户端可以发送任何相应 ClientCertificateType 的证书，除非有相反的外部安排。

source: If the cipher suite is TLS_NULL_WITH_NULL_NULL, encryption consists of the identity operation (i.e., the data is not encrypted, and the MAC size is zero, implying that no MAC is used).
zh_cn: 如果加密套件是 TLS_NULL_WITH_NULL_NULL，则加密由恒等操作组成(即，数据未加密，并且 MAC 大小为零，暗示不使用 MAC)。

source: If the client attempts a 0-RTT handshake but the server rejects it, the server will generally not have the 0-RTT record protection keys and must instead use trial decryption (either with the 1-RTT handshake keys or by looking for a cleartext ClientHello in the case of a HelloRetryRequest) to find the first non-0-RTT message.
zh_cn: 如果客户端尝试 0-RTT 握手但服务器拒绝它，则服务器通常不具有 0-RTT 记录保护密钥，而必须使用试用解密(使用 1-RTT 握手密钥或通过查找明文 ClientHello 在 HelloRetryRequest 的情况下)找到第一个非 0-RTT 消息。

source: If the client cannot construct an acceptable chain using the provided certificates and decides to abort the handshake, then it MUST abort the handshake with an appropriate certificate-related alert (by default, "unsupported_certificate"; see Section 6.2 for more information).
zh_cn: 如果客户端无法使用提供的证书构造可接受的链并决定中止握手，那么它必须使用适当的证书相关警报中止握手(默认情况下，“unsupported_certificate”;有关更多信息，请参见第 6.2 节)。

source: If the client does not send any certificates (i.e., it sends an empty Certificate message), the server MAY at its discretion either continue the handshake without client authentication or abort the handshake with a "certificate_required" alert.
zh_cn: 如果客户端没有发送任何证书(即，它发送一个空的 Certificate 消息)，服务器可以自行决定是否继续握手而不进行客户端身份验证，或者使用“certificate_required”警报中止握手。

source: If the client does not send any certificates, the server MAY at its discretion either continue the handshake without client authentication, or respond with a fatal handshake_failure alert.
zh_cn: 如果客户端没有发送任何证书，服务器可以自行决定是否在没有客户端身份验证的情况下继续握手，或者使用致命的 handshake_failure 警报进行响应。

source: If the client does not send the signature_algorithms extension, the server MUST do the following:
zh_cn: 如果客户端没有发送 signature_algorithms 扩展，则服务器必须执行以下操作：

source: If the client does not support the default algorithms, or supports other hash and signature algorithms (and it is willing to use them for verifying messages sent by the server, i.e., server certificates and server key exchange), it MUST send the signature_algorithms extension, listing the algorithms it is willing to accept.
zh_cn: 如果客户端不支持默认算法，或者支持其他散列和签名算法(并且它愿意使用它们来验证服务器发送的消息，即服务器证书和服务器密钥交换)，它必须发送 signature_algorithms 扩展，列出它愿意接受的算法。

source: If the client does retry this request, it MAY use the following "binary exponential backoff" algorithm to be assured of obtaining a reliable response:
zh_cn: 如果客户端重试此请求，它可以使用以下“二进制指数退避”算法来确保获得可靠的响应：

source: If the client has a cache [RFC7234] and the request can be satisfied by it, then the request is usually directed there first.
zh_cn: 如果客户端具有缓存 [RFC7234] 并且请求可以被它满足，则通常首先将请求指向该请求。

source: If the client has external information as to the expected identity of the server, the hostname check MAY be omitted.
zh_cn: 如果客户端具有关于服务器的预期标识的外部信息，则可以省略主机名检查。

source: If the client has not provided a sufficient "key_share" extension (e.g., it includes only DHE or ECDHE groups unacceptable to or unsupported by the server), the server corrects the mismatch with a HelloRetryRequest and the client needs to restart the handshake with an appropriate "key_share" extension, as shown in Figure 2.
zh_cn: 如果客户端没有提供足够的“key_share”扩展(例如，它仅包括服务器不可接受或不支持的 DHE 或 ECDHE 组)，则服务器使用 HelloRetryRequest 更正不匹配，并且客户端需要使用适当的“key_share”扩展重新启动握手，如图 2 所示。

source: If the client has offered the "signature_algorithms" extension, the signature algorithm and hash algorithm MUST be a pair listed in that extension.
zh_cn: 如果客户端提供了“signature_algorithms”扩展，则签名算法和散列算法必须是该扩展中列出的一对。

source: If the client has sent a certificate which contains a suitable Diffie-Hellman key (for fixed_dh client authentication), then Yc is implicit and does not need to be sent again.
zh_cn: 如果客户端发送包含合适的 Diffie-Hellman 密钥(对于 fixed_dh 客户认证)的证书，然后 Yc 是隐含的，不需要再次发送。

source: If the client has sent a certificate with signing ability, a digitally-signed CertificateVerify message is sent to explicitly verify possession of the private key in the certificate.
zh_cn: 如果客户端已发送具有签名能力的证书，则会发送经过数字签名的 CertificateVerify 消息，以明确验证是否拥有证书中的私钥。

source: If the client ignored some of the required certificate extension OIDs and supplied a certificate that does not satisfy the request, the server MAY at its discretion either continue the connection without client authentication or abort the handshake with an "unsupported_certificate" alert.
zh_cn: 如果客户端忽略了一些所需的证书扩展 OID 并提供了不满足请求的证书，则服务器可以自行决定是否在没有客户端身份验证的情况下继续连接，或者使用“unsupported_certificate”警报中止握手。

source: If the client is attempting a PSK key establishment, it SHOULD advertise at least one cipher suite indicating a Hash associated with the PSK.
zh_cn: 如果客户端正在尝试 PSK 密钥建立，则它应该通告至少一个密码套件，该密码套件指示与 PSK 相关联的哈希。

source: If the client is sending a certificate containing a static DH exponent (i.e., it is doing fixed_dh client authentication), then this message MUST be sent but MUST be empty.
zh_cn: 如果客户端发送包含静态 DH 指数的证书(即，它正在进行 fixed_dh 客户端身份验证)，则必须发送此消息但必须为空。

source: If the client opts to do so, it MUST supply both the "pre_shared_key" and "early_data" extensions.
zh_cn: 如果客户端选择这样做，它必须提供“pre_shared_key”和“early_data”扩展。

source: If the client opts to send an OCSP response, the body of its "status_request" extension MUST be a CertificateStatus structure as defined in [RFC6066].
zh_cn: 如果客户端选择发送 OCSP 响应，则其“status_request”扩展的主体必须是 [RFC6066] 中定义的 CertificateStatus 结构。

source: If the client provided a "signature_algorithms" extension, then all certificates provided by the server MUST be signed by a hash/signature algorithm pair that appears in that extension.
zh_cn: 如果客户端提供了“signature_algorithms”扩展，那么服务器提供的所有证书必须由该扩展中出现的散列/签名算法对进行签名。

source: If the client sees a response that indicates the server does not wish to receive the message body and is closing the connection, the client SHOULD immediately cease transmitting the body and close its side of the connection.
zh_cn: 如果客户端看到响应，指示服务器不希望接收消息正文并且正在关闭连接，则客户端应该立即停止传输正文并关闭其连接端。

source: If the client sees an error status, it SHOULD immediately cease transmitting the body.
zh_cn: 如果客户端看到错误状态，它应该立即停止传输消息主体。

source: If the client supports only the default hash and signature algorithms (listed in this section), it MAY omit the signature_algorithms extension.
zh_cn: 如果客户端仅支持默认的散列和签名算法(在本节中列出)，则可以省略 signature_algorithms 扩展。

source: If the code example is left unchanged, this will result in a compile time error (however, often with misleading error message about lack of overload).
zh_cn: 如果代码示例保持不变，这将导致编译时错误(但是，通常会出现关于缺少重载的误导性错误消息)。

source: If the communication is considered in isolation, then successful actions ought to be reflected in corresponding changes to the observable interface provided by servers.
zh_cn: 如果单独考虑通信，那么成功的操作应该反映在服务器提供的可观察接口的相应更改中。

source: If the connection does not exist (CLOSED) then a reset is sent in response to any incoming segment except another reset.
zh_cn: 如果连接不存在(CLOSED)，则发送复位以响应除另一个复位之外的任何传入报文段。

source: If the connection is from a trusted gateway, that inconsistency might be expected; otherwise, it might indicate an attempt to bypass security filters, trick the server into delivering non-public content, or poison a cache.
zh_cn: 如果连接来自可信网关，则可能会出现这种不一致；否则，它可能表示试图绕过安全过滤器，欺骗服务器传递非公共内容或中毒缓存。

source: If the connection is in a synchronized state (ESTABLISHED, FIN-WAIT-1, FIN-WAIT-2, CLOSE-WAIT, CLOSING, LAST-ACK, TIME-WAIT), any unacceptable segment (out of window sequence number or unacceptible acknowledgment number) must elicit only an empty acknowledgment segment containing the current send-sequence number and an acknowledgment indicating the next sequence number expected to be received, and the connection remains in the same state.
zh_cn: 如果连接处于同步状态（ESTABLISHED，FIN-WAIT-1，FIN-WAIT-2，CLOSE-WAIT，CLOSING，LAST-ACK，TIME-WAIT），则任何不可接受的报文段（序列号不在窗口内或不可接授的确认）必须仅引出包含当前发送序列号的空确认报文段和指示预期接收的下一个序列号的确认，并且连接保持相同状态。

source: If the connection is in any non-synchronized state (LISTEN, SYN-SENT, SYN-RECEIVED), and the incoming segment acknowledges something not yet sent (the segment carries an unacceptable ACK), or if an incoming segment has a security level or compartment which does not exactly match the level and compartment requested for the connection, a reset is sent.
zh_cn: 如果连接处于任何非同步状态(LISTEN，SYN-SENT，SYN-RECEIVED)，并且传入报文段确认尚未发送的内容(该报文段带有不可接受的 ACK)，或者传入的报文段具有的安全级别或 compartment 与连接请求的级别和 compartment 不完全匹配，则发送重置。

source: If the corresponding certificate type extension ("server_certificate_type" or "client_certificate_type") was not negotiated in EncryptedExtensions, or the X.509 certificate type was negotiated, then each CertificateEntry contains a DER-encoded X.509 certificate.
zh_cn: 如果未在 EncryptedExtensions 中协商相应的证书类型扩展(“server_certificate_type”或“client_certificate_type”)，或者协商了 X.509 证书类型，则每个 CertificateEntry 都包含 DER 编码的 X.509 证书。

source: If the corresponding public key's parameters are present, then the parameters in the signature MUST be identical to those in the public key.
zh_cn: 如果存在相应的公钥参数，则签名中的参数必须与公钥中的参数相同。

source: If the data is already available as an array of objects, a list of objects or any `Iterable` source, the respective `from` overloads will handle the backpressure and emission of such sources:
zh_cn: 如果数据已经作为一个对象数组，一个对象列表或任何 `Iterable` 源提供，则相应的 `from` 重载将处理这些源的背压和发射：

source: If the decompression function encounters a TLSCompressed.fragment that would decompress to a length in excess of 2^14 bytes, it MUST report a fatal decompression failure error.
zh_cn: 如果解压缩函数遇到将解压缩到超过 2^14 字节长度的 TLSCompressed.fragment，它必须报告致命的解压缩失败错误。

source: If the decryption fails, a fatal bad_record_mac alert MUST be generated.
zh_cn: 如果解密失败，则必须生成致命的 bad_record_mac 警报。

source: If the decryption fails, the receiver MUST terminate the connection with a "bad_record_mac" alert.
zh_cn: 如果解密失败，接收方必须使用“bad_record_mac”警报终止连接。

source: If the file doesn't exist or can't be read properly, the end consumer will print out `IOException` directly.
zh_cn: 如果文件不存在或无法正确读取，最终消费者将直接打印出 `IOException`。

source: If the final response to the last request on a connection has been completely received and there remains additional data to read, a user agent MAY discard the remaining data or attempt to determine if that data belongs as part of the prior response body, which might be the case if the prior message's Content-Length value is incorrect.
zh_cn: 如果已完全接收到对连接的最后一个请求的最终响应并且仍有其他数据需要读取，则用户代理可以丢弃剩余数据或尝试确定该数据是否属于先前响应主体的一部分，这可能是如果先前消息的 Content-Length 值不正确的情况。

source: If the first example is rewritten:
zh_cn: 如果第一个示例被重写为：

source: If the host as determined by rule 1 or 2 is not a valid host on the server, the response MUST be a 400 (Bad Request) error message.
zh_cn: 如果规则 1 或 2 确定的主机不是服务器上的有效主机，则响应必须是 400(错误请求)错误消息。

source: If the host identifier is provided as an IP address, the origin server is the listener (if any) on the indicated TCP port at that IP address.
zh_cn: 如果主机标识符作为 IP 地址提供，则源服务器是该 IP 地址上指示的 TCP 端口上的监听器(如果有)。

source: If the hostname does not match the identity in the certificate, user oriented clients MUST either notify the user (clients MAY give the user the opportunity to continue with the connection in any case) or terminate the connection with a bad certificate error.
zh_cn: 如果主机名与证书中的标识不匹配，则面向用户的客户端必须通知用户(客户端可以在任何情况下为用户提供继续连接的机会)或终止具有错误证书错误的连接。

source: If the hostname is available, the client MUST check it against the server's identity as presented in the server's Certificate message, in order to prevent man-in-the-middle attacks.
zh_cn: 如果主机名可用，客户端必须根据服务器的证书消息中显示的服务器身份进行检查，以防止中间人攻击。

source: If the implementation chooses to send an alert but intends to close the connection immediately afterwards, it MUST send that alert at the fatal alert level.
zh_cn: 如果实现选择发送警报，但打算随后立即关闭连接，则必须以致命警报级别发送该警报。

source: If the inbound connection fails before receiving a response, the pipelining intermediary MAY attempt to retry a sequence of requests that have yet to receive a response if the requests all have idempotent methods; otherwise, the pipelining intermediary SHOULD forward any received responses and then close the corresponding outbound connection(s) so that the outbound user agent(s) can recover accordingly.
zh_cn: 如果入站连接在接收响应之前失败，则流水线中介可以尝试重试尚未接收响应的请求序列（如果请求都具有幂等方法）;否则，流水线中介应该转发任何收到的响应，然后关闭相应的出站连接，以便出站用户代理可以相应地恢复。

source: If the incoming segment has an ACK field, the reset takes its sequence number from the ACK field of the segment, otherwise the reset has sequence number zero and the ACK field is set to the sum of the sequence number and segment length of the incoming segment.
zh_cn: 如果传入报文段具有 ACK 字段，则复位从报文段的 ACK 字段获取其序列号，否则复位具有序列号零，并且 ACK 字段被设置为传入报文段的序列号和报文段长度的总和。

source: If the key is a signature key, it MUST be usable with some hash/signature algorithm pair in supported_signature_algorithms.
zh_cn: 如果密钥是签名密钥，则它必须与 supported_signature_algorithms 中的某些散列/签名算法对一起使用。

source: If the library/code already did this, the undeliverable `InterruptedException`s should stop now.
zh_cn: 如果库/代码已经这样做了，那么无法传递的 `InterruptedException` 应该立即停止。

source: If the list contains cipher suites that the server does not recognize, support, or wish to use, the server MUST ignore those cipher suites and process the remaining ones as usual.
zh_cn: 如果列表包含服务器无法识别，不支持或不希望使用的密码套件，则服务器必须忽略这些密码套件并像正常处理剩余密码套件。

source: If the list contains cipher suites the server does not recognize, support, or wish to use, the server MUST ignore those cipher suites, and process the remaining ones as usual.
zh_cn: 如果列表包含服务器无法识别，不支持或不希望使用的加密套件，则服务器必须忽略这些加密套件，并照常处理剩余的加密套件。

source: If the media type remains unknown, the recipient SHOULD treat it as type "application/octet-stream".
zh_cn: 如果媒体类型仍然未知，则接收者应该将其视为“application/octet-stream”类型。

source: If the message does include a non- identity transfer-coding, the Content-Length MUST be ignored.
zh_cn: 如果消息确实包含非标识传输编码，则必须忽略 Content-Length。

source: If the new field values indicate that the cached entity differs from the current entity (as would be indicated by a change in Content-Length, Content-MD5, ETag or Last-Modified), then the cache MUST treat the cache entry as stale.
zh_cn: 如果新字段值指示缓存的实体与当前实体不同(如 Content-Length，Content-MD5，ETag 或 Last-Modified 中的更改所示)，则缓存必须将缓存条目视为陈旧。

source: If the padding length were the minimum necessary, 6, the padding would be 6 bytes, each containing the value 6.
zh_cn: 如果填充长度是必需的最小值，6，填充将是 6 个字节，每个包含值 6。

source: If the port is empty or not given, port 80 is assumed.
zh_cn: 如果端口为空或未给出，则假定端口 80。

source: If the port is equal to the default port for a scheme, the normal form is to omit the port subcomponent.
zh_cn: 如果端口等于方案的默认端口，则通常的形式是省略端口子组件。

source: If the port subcomponent is empty or not given, TCP port 80 (the reserved port for WWW services) is the default.
zh_cn: 如果端口子组件为空或未给定，则 TCP 端口 80(WWW 服务的保留端口)是默认值。

source: If the primary resource has multiple representations, as is often the case for resources whose representation is selected based on attributes of the retrieval request (a.k.a., content negotiation), then whatever is identified by the fragment should be consistent across all of those representations.
zh_cn: 如果主要资源具有多个表示，那么对于其表示基于检索请求的属性(例如，内容协商)来选择的资源通常是这种情况，则片段所标识的任何表示应该在所有这些表示中是一致的。

source: If the public key is carried in an X.509 certificate, it MUST use the RSASSA-PSS OID [RFC5756].
zh_cn: 如果公钥在 X.509 证书中携带，则它必须使用 RSASSA-PSS OID [RFC5756]。

source: If the public key is carried in an X.509 certificate, it MUST use the rsaEncryption OID [RFC5280].
zh_cn: 如果公钥在 X.509 证书中携带，它必须使用 rsaEncryption OID [RFC5280]。

source: If the purpose of such a resource is to perform an unsafe action, then the resource owner MUST disable or disallow that action when it is accessed using a safe request method.
zh_cn: 如果此类资源的目的是执行不安全的操作，那么资源所有者必须在使用安全请求方法访问该操作时禁用或禁止该操作。

source: If the receiver was in SYN-RECEIVED state and had previously been in the LISTEN state, then the receiver returns to the LISTEN state, otherwise the receiver aborts the connection and goes to the CLOSED state.
zh_cn: 如果接收器处于 SYN-RECEIVED 状态并且之前一直处于 LISTEN 状态，则接收器返回 LISTEN 状态，否则接收器中止连接并进入 CLOSED 状态。

source: If the receiver was in any other state, it aborts the connection and advises the user and goes to the CLOSED state.
zh_cn: 如果接收器处于任何其他状态，它将中止连接并通知用户并进入 CLOSED 状态。

source: If the receiver was in the LISTEN state, it ignores it.
zh_cn: 如果接收器处于 LISTEN 状态，则忽略它。

source: If the receiving TCP is in a non-synchronized state (i.e., SYN-SENT, SYN-RECEIVED), it returns to LISTEN on receiving an acceptable reset.
zh_cn: 如果接收 TCP 处于非同步状态(即，SYN-SENT，SYN-RECEIVED)，则在接收到可接受的重置时它返回到 LISTEN。

source: If the receiving party decides not to proceed with the connection (e.g., after having received a no_renegotiation alert that it is not willing to accept), it SHOULD send a fatal alert to terminate the connection.
zh_cn: 如果接收方决定不继续进行连接(例如，在收到不愿意接受的 no_renegotiation 警报之后)，它应该发送致命警报以终止连接。

source: If the recovery occurs quickly enough, any old duplicates in the net bearing sequence numbers in the neighborhood of S1 may arrive and be treated as new packets by the receiver of the new incarnation of the connection.
zh_cn: 如果恢复足够快地发生，则 S1 附近的净承载序列号中的任何旧重复可以到达并且被连接的新化身的接收器视为新分组。

source: If the request is not satisfied by a cache, then a typical client will check its configuration to determine whether a proxy is to be used to satisfy the request.
zh_cn: 如果缓存不满足请求，则典型客户端将检查其配置以确定是否使用代理来满足请求。

source: If the request is valid, the response SHOULD contain the entire request message in the entity-body, with a Content-Type of "message/http".
zh_cn: 如果请求有效，则响应应该在实体主体中包含整个请求消息，其内容类型为“message/http”。

source: If the request passes through a cache and the Request-URI identifies one or more currently cached entities, those entries SHOULD be treated as stale.
zh_cn: 如果请求通过缓存并且 Request-URI 标识一个或多个当前缓存的实体，则这些条目应该被视为陈旧。

source: If the request-target is in absolute-form, the effective request URI is the same as the request-target.
zh_cn: 如果请求目标是绝对格式，则有效请求 URI 与请求目标相同。

source: If the request-target is in authority-form or asterisk-form, the effective request URI's combined path and query component is empty.
zh_cn: 如果 request-target 是 authority-form 或 asterisk-from，则有效请求 URI 组合 path 和 query 组件为空。
